[
  {
    "title": "Objectives",
    "data": [
      {
        "points": [
          "Application forms are available at the college campus.",
          "Duly filled application forms should be registered at the college office within the prescribed time.",
          "Incomplete, illegible or over written application form will not be considered for admission.",
          "Mere registration of application form is no guarantee for selection of admission.",
          "The optional subject and II language, once selected cannot be changed under any circumstances. The medium of instructions of Sanskrit shall be in Kannada.",
          "Provisional selection shall be made after considering academic records and the curriculum vitae of the candidate.",
          "The list of provisionally selected candidates shall be displayed on the college Notice Board before the admission such candidates will have to appear for personal interview with the Dean for the final selection at the stipulated time."
        ]
      }
    ]
  },
  {
    "title": "Submission of Application Form",
    "data": [
      {
        "points": [
          "Maintain and upgrade campus IT infrastructure.",
          "Provide technical support for hardware and software issues.",
          "Ensure secure and fast internet connectivity.",
          "Organize training sessions on new technologies.",
          "Promote the use of digital tools for learning and administration."
        ]
      }
    ]
  },
  {
    "title": "Fees",
    "data": [
      {
        "points": [
          "Encourage waste segregation and recycling.",
          "Organize tree plantation drives and green campaigns.",
          "Promote the use of renewable energy sources.",
          "Conduct workshops on environmental conservation.",
          "Foster a culture of eco-friendly practices."
        ]
      }
    ]
  },
  {
    "title": "Mode of Payment",
    "data": [
      {
        "points": [
          "Provide career counseling and guidance.",
          "Organize job fairs and campus recruitment drives.",
          "Offer training on resume building and interview skills.",
          "Facilitate internships and industry exposure.",
          "Build partnerships with companies for placement opportunities."
        ]
      }
    ]
  }
]
